app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Andrew"], ["body", "Totally feel your pain. "], ["post_id", 2], ["created_at", 2016-08-01 05:10:43 UTC], ["updated_at", 2016-08-01 05:10:43 UTC]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)